sapapi/src/test/resources/pi_ProfileProcessor/getViewsRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="urn:ProfileProcessorVi"
	xmlns:ns1="urn:com.sap.aii.af.service.statistic.ws.impl">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
		<ns0:getViews>
			<ns0:wSProfile>
				<ns1:activation>DATETIME</ns1:activation>
				<ns1:applicationKey>STRING</ns1:applicationKey>
				<ns1:profile>BASE64BINARY</ns1:profile>
				<ns1:profileKey>XPI</ns1:profileKey>
				<ns1:view>BASE64BINARY</ns1:view>
				<ns1:viewKey>STRING</ns1:viewKey>
			</ns0:wSProfile>
		</ns0:getViews>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
